Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: ཏ་ལ་དྲུག་ཙམའམ། ཏ་ལ་བདུན་ཙམ་དུ་སྟེང་དུ་འཕེན་ཏོ། །ཇི་ཙམ་དུ་འདོད་པ་དེ་ཙམ་དུའང་འཕེན་ཏོ། །གཞན་ཡང་གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་མཆོག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ཏེ།
en: “Moreover, young man, bodhisattva mahāsattvas who have completely pure physical conduct attain the perfection of supreme miraculous powers.

source: དེ་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་རྣམ་པར་སྨིན་པ་རྣམ་པར་དག་པའི་བསོད་ནམས་ཡོངས་སུ་གཟུང་ཞིང་དབེན་པར་གྱུར་ཏེ།
en: They have ripened the bases of miraculous powers, possess pure merit, and have detachment.

source: ཐམས་ཅད་དུ་རྗེས་སུ་སོང་ཞིང་། དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐོབ་པས་ཟག་པ་མེད་པའི་བསོད་ནམས་ཡོངས་སུ་རྫོགས་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའི་མིག་ཏུ་གྱུར་པས་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་ལྡན་པར་འགྱུར་རོ།
en: They can go anywhere, have attained this samādhi, have completely perfected immaculate merit, and have unimpeded vision of all worlds, and therefore have gained miraculous powers.

source: །དེ་ལ་རྫུ་འཕྲུལ་གང་ཞེ་ན།
en: What is this attainment of miraculous powers?

source: གང་འགྲུབ་པ་དང་། སྨོན་པ་དང་། འབྱོར་པ་དང་། ཡོངས་སུ་རྫོགས་པ་འདི་ནི་རྫུ་འཕྲུལ་ཞེས་བྱའོ།
en: Through miraculous powers there is the perfection of the accomplishment of aspirations and success.

source: །དེ་ལ་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གང་ཞེ་ན།
en: “What kind of attainment of miraculous powers are these miraculous powers that are spoken of?

source: རྫུ་འཕྲུལ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྫུ་འཕྲུལ་གྱི་ཡུལ་རྣམ་པ་མང་པོ་མྱོང་བར་བྱེད་པ་ཡིན་ཏེ།
en: Bodhisattva mahāsattvas who possess miraculous powers experience a range of different kinds of miracles:

source: གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར། མང་པོར་གྱུར་ནས་གཅིག་ཏུ་འགྱུར། སྣང་བར་གྱུར་ཅིང་མི་སྣང་བར་ཡང་འགྱུར།
en: they transform from one to many, from many to one, and from visible to invisible;

source: རྩིག་པ་ལ་ཡང་ཐད་ཀར་འགྲོ། ར་བ་ལ་ཡང་ཐད་ཀར་འགྲོ། རི་ལ་ཡང་མི་ཐོགས་པར་འགྲོ།
en: they pass without impediment through house walls, through city walls, and through mountains;

source: ནམ་མཁའ་ལ་ཡང་འགྲོ་སྟེ། དཔེར་ན་འདབ་ཆགས་བྱ་བཞིན་ནོ།
en: they travel through the air just like a bird;

source: །ས་ལ་ཡང་སྟེང་དུ་འབྱུང་བ་དང་། བྱིའུ་ཟུལ་བྱེད་དེ། དཔེར་ན་ཆུ་ལ་བྱ་བ་བཞིན་ནོ། །ཆུ་ལ་ཡང་མི་ནུབ་པར་འགྲོ་སྟེ།
en: they dive into the ground and emerge from it, just as they would in water;

source: དཔེར་ན་སའི་ཕུང་པོ་ཆེན་པོ་ལ་བྱ་བ་བཞིན་ནོ།
en: they stand on water just like they would on the ground;

source: །དུ་བ་འཐུལ་བར་ཡང་བྱེད་འབར་བར་ཡང་བྱེད་དེ། དཔེར་ན་མེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་ནོ།
en: they give off smoke and flames, just like a great blaze of fire;

source: །བདག་གི་ལུས་ལས་ཆུའི་རྒྱུན་ཆེན་པོ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་འབྱིན་ཏེ། དཔེར་ན་སྤྲིན་ཆེན་པོ་བཞིན་ནོ། །ཆུའི་རྒྱུན་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་བསྲེགས་ཤིང་རབ་ཏུ་ཚིག་སྟེ། མེས་རབ་ཏུ་འབར་ཞིང་འབར་བ་གཅིག་ཏུ་གྱུར་པ་ཞི་བར་བྱེད་དོ། །ཟླ་བ་དང་ཉི་མ་འདི་གཉིས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ།
en: their bodies emit many thousands of trillions of great torrents of water, just like a great cloud that can extinguish the great fire of a thousand-billion world universe being on fire; they grasp in their hands and polish the moon and the sun, which are so miraculous, powerful, and majestic;

source: འདི་ལྟར་མཐུ་ཆེ་བ། འདི་ལྟར་གཟི་བརྗིད་ཆེ་བ་ཡང་ལག་པས་འཛིན་ཅིང་ཀུན་ཏུ་ཉུག་པར་བྱེད་དོ། །ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སེམས་ཅན་རྣམས་ལ་ལུས་ཀྱིས་དབང་སྒྱུར་རོ།
en: and just as they wish, their bodies have power over beings, as far up as those in Brahmā’s realm.”

source: །ས་ལ་བྱིའུ་ཟུལ་བྱེད་ཅིང་སྟེང་བྱུང་བྱེད།
en: “They dive into the earth and reemerge,

source: །ཆུ་དག་ལ་ཡང་ཐོགས་པ་མེད་པར་འགྲོ།
en: They walk unimpeded on water,

source: །བྱ་བཞིན་ནམ་མཁའི་ངོས་ལ་འགྲོ་བར་བྱེད།
en: They travel through the air like a bird,

source: །རྫུ་འཕྲུལ་གྱིས་ནི་དུད་འཐུལ་འབར་བར་བྱེད།
en: And they miraculously emit smoke and flames. {47}

source: །ཇི་ལྟར་བར་སྣང་ལ་ནི་རླུང་མི་ཐོགས།
en: “Just as the wind is unimpeded by space,

source: །སྤྲིན་གྱི་ཕུང་པོ་མང་པོ་འགྲོ་བ་ལྟར།
en: And a multitude of clouds move through it,

source: །དེ་བཞིན་རྣལ་འབྱོར་པ་ཡང་ནམ་མཁའ་ལ།
en: In that way the yogins fly through the air,

source: །རླུང་དང་སྤྲིན་བཞིན་དུ་ནི་ཐོགས་མེད་འགྲོ།
en: Unimpeded like the wind and the clouds. {48}

source: །ཞིང་རྣམས་མེ་ཡིས་ཚིག་ཅིང་འབར་བ་དག །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པས་དེ་མཐོང་ནས།
en: “The skilled bodhisattvas, on seeing Realms burning in a blazing inferno,

source: །དེས་ནི་རང་གི་ལུས་ལས་ཆུ་ཕྱུང་སྟེ།
en: Emit water from their bodies,

source: །བྱེ་བ་སྙེད་ཀྱི་ཞིང་དེ་ཞི་བར་བྱེད།
en: Extinguishing the fire of millions of realms. {i}

source: །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་འདུག་བཞིན་དུ།
en: “The skilled bodhisattvas, while seated,

source: །ཉི་ཟླ་ལ་ནི་ལག་པས་ཡོངས་སུ་འཛིན།
en: Grasp the sun and moon in their hands.

source: །དེས་ནི་ཚངས་པའི་འཇིག་རྟེན་ཉེར་རིག་ནས།
en: Seated, they know the realm of Brahmā

source: །ཚངས་པ་བྱེ་བ་དག་ལ་ཆོས་སྟོན་བྱེད།
en: And teach the Dharma to millions of Brahmās. {49}

source: །གང་ཚེ་དེ་ནི་ཆོས་སྟོན་འདོད་གྱུར་ན།
en: “When they wish to teach the Dharma,

source: །སྟོང་གསུམ་ཆེན་པོ་དེས་ནི་གོ་བར་བྱེད།
en: The entire billion-world universe hears them.

source: །འདོད་ན་དེ་ནི་ཞིང་མང་བྱེ་བར་ཡང་། །སྲོག་ཆགས་བྱེ་བ་མང་ལ་ཆོས་རྣམས་སྟོན།
en: As they wish, they teach the Dharma In millions of realms to millions of beings.” {50}

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱའོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, you should train by thinking, ‘I will practice completely pure physical conduct in that way.’ Why is that?

source: གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་སྒྲ་རྣམས་ལྷའི་དང་། མིའི་དང་། སེམས་ཅན་དམྱལ་བ་པ་རྣམས་ཀྱི་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་རྣམས་ཀྱི་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་རྣམས་ཀྱི་སྒྲ་ཉེ་བའམ་རྒྱང་རིང་པོ་ཡང་ཐོས་སོ།
en: Because, young man, bodhisattva mahāsattvas who have completely pure physical conduct have a divine sense of hearing so that they can hear from afar the voices of devas, humans, beings in the hells, those reborn as animals, and those in the realm of Yama.

source: །གཞན་ཡང་གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱའོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Moreover, young man, you should train by thinking, ‘I will practice completely pure physical conduct in that way.’ Why is that?

source: གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྟན་ལ་འདུག་བཞིན་དུ་ལྷའི་སྣའི་དབང་པོས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ལྷའི་ཡིད་དུ་འོང་བའི་ཆོས་ཀྱི་དྲི་ཇི་སྙེད་ཡོད་པ་ཉེའང་རུང་། རྒྱང་རིང་པོའང་རུང་སྟེ་དེ་དག་ཐམས་ཅད་ཚོར་རོ།
en: Because, young man, bodhisattva mahāsattvas who have completely pure physical conduct, while they are seated, with their divine sense of smell can smell from afar all the divine pleasant aromas of the Dharma that there are in all the worlds in the billion-world universe.”

source: གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཕ་རོལ་དང་གང་ཟག་ཕ་རོལ་གྱི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། སྤྱོད་པ་སེམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Because, young man, bodhisattva mahāsattvas who have completely pure physical conduct know accurately the motivation, conduct, and thoughts of other beings and individuals.

source: འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཀྱང་འདོད་ཆགས་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས།
en: They accurately know a mind that has desire to be a mind that has desire.

source: འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They accurately know a mind that is without desire to be a mind that is without desire.

source: །གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། ཞེ་སྡང་དང་བཅས་པ་དང་། ཞེ་སྡང་དང་བྲལ་བ་དང་། གཏི་མུག་དང་བཅས་པ་དང་། གཏི་མུག་དང་བྲལ་བ་དང་། སྲེད་པ་དང་བཅས་པ་དང་། སྲེད་པ་དང་བྲལ་བ་དང་། ལེན་པ་དང་བཅས་པ་དང་། ལེན་པ་དང་བྲལ་བ་དང་། བསྡུས་པ་དང་། གཡེངས་པ་དང་། ལོག་པ་དང་། མ་ལོག་པ་དང་། ཆེན་པོར་གྱུར་པ་དང་། ཆེན་པོར་གྱུར་པ་མ་ཡིན་པ་དང་། འོད་གསལ་བ་དང་། འོད་གསལ་བ་མ་ཡིན་པ་དང་། ཚད་དང་བཅས་པ་དང་། ཚད་མེད་པ་དང་། བླ་ན་ཡོད་པ་དང་། བླ་ན་མེད་པ་དང་། མཉམ་པར་བཞག་པ་དང་། མཉམ་པར་བཞག་པ་མ་ཡིན་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བ་མ་ཡིན་པ་དང་། ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་ཀྱང་ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཉོན་མོངས་པ་མེད་པའི་སེམས་ཀྱང་ཉོན་མོངས་པ་མེད་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “It is the same as that for having anger and being without anger, having ignorance and being without ignorance, having craving and being without craving, having grasping and being without grasping, having concentration and distraction, having error and no error, having greatness and no greatness, having clarity and no clarity, being valid and being invalid, being surpassable and unsurpassable, being in meditation and not being in meditation, and being liberated and not being liberated, and they accurately know a mind that has kleśas to be a mind that has kleśas, and they accurately know a mind that has no kleśas to be a mind that has no kleśas.

source: །གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ། སྐྱེ་བ་གཅིག་ཀྱང་རྗེས་སུ་དྲན།
en: “Young man, bodhisattva mahāsattvas who have completely pure physical conduct remember previous lives in many ways:

source: གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་དང་། སྐྱེ་བ་བརྒྱ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: they remember one previous life, or two, or three, or four, or five, or ten, or twenty, or thirty, or forty, or fifty, or remember a hundred previous lifetimes.

source: །སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་སྟོང་དང་། སྐྱེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: They remember a thousand lives, a hundred thousand lives, and so on, up to many quintillions of previous lives.

source: །སྡུད་པའི་བསྐལ་པ་དང་། འབྱུང་བའི་བསྐལ་པ་ཡང་རྗེས་སུ་དྲན་ནོ། །སྲུད་པ་དང་། འབྱུང་བའི་བསྐལ་པ་དུ་མའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །བསྐལ་པ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: “They remember an eon of dissolution and an eon of origination, and so on up to many eons of dissolution and eons of origination.

source: །བསྐལ་པ་བརྒྱ་དང་། བསྐལ་པ་སྟོང་དང་། བསྐལ་པ་བརྒྱ་སྟོང་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །སྔོན་གྱི་མཐའ་བྱེ་བའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །བདག་སྔོན་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་ཏེ། མིང་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ།
en: “They remember one eon, and they remember a hundred eons, a thousand eons, a hundred thousand eons, and so on, up to remembering many quintillions of eons.

source: རིགས་ནི་འདི་ཞེས་བྱ། ཁ་དོག་ནི་འདི་འདྲ། ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། འཚོ་བ་ནི་འདི་འདྲ། ཚེ་ནི་འདི་ཙམ་ཞིག་ཏུ་ཐུབ།
en: “They remember as many as ten million past lives, saying, ‘I was born as such and such a being, this was my name, this was my family, this was my caste, this was my color, this was the food that I ate, this was my livelihood, this is how long a lifespan was, this is how long I lived, and this was the happiness and suffering I experienced.

source: ཡུན་ནི་འདི་སྲིད་ཅིག་ཏུ་གནས་གནས། བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་། དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་ཏེ།
en: Then when I died I was reborn as such and such;

source: དེ་ནས་ཀྱང་ཤི་འཕོས་ནས་འདིར་སྐྱེས་སོ།
en: then when I died again I was reborn here.’

source: །ཞེས་རྣམ་པ་དང་བཅས་པ་དང་། ཡུལ་ཕྱོགས་དང་བཅས་པ་དང་། གཞི་ཅི་ལས་གྱུར་པ་དང་བཅས་པར་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་ཡང་དག་པར་རྗེས་སུ་དྲན་ནོ།
en: “They remember correctly the many different aspects of their previous lives, such as what appearance they had, the place where they lived, and the cause for that rebirth.

source: །གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་སེམས་ཅན་རྣམས་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་བཟང་བ་དང་། ཁ་དོག་ངན་པ་དང་། བདེ་འགྲོར་སོང་བ་དང་། ངན་འགྲོར་སོང་བ་དང་། ངན་པ་དང་། བཟང་པོ་དང་། བཟང་འགྲོར་འགྲོ་བ་དང་། ངན་འགྲོར་འགྲོ་བའི་སེམས་ཅན་ལས་བཞིན་དུ་ཉེ་བར་འགྲོ་བ་དག་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “Young man, bodhisattva mahāsattvas who have completely pure physical conduct have divine vision, which surpasses human vision, so that they know accurately, according to the karma of beings, their deaths and their rebirths, whether they have good color or bad color, whether they are fortunate or unfortunate, whether it is a good rebirth or a bad rebirth, and whether they are going to the higher realms or the lower realms.

source: །སེམས་ཅན་འདི་རྣམས་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་ཏེ།
en: “They say, ‘These beings conducted themselves badly with their bodies, conducted themselves badly with their speech, and conducted themselves badly in their minds.

source: འཕགས་པ་རྣམས་ལ་སྐུར་པ་ལོག་པར་ལྟ་བ་དག་ལོག་པར་ལྟ་བ་ཡང་དག་པར་འཛིན་པའི་རྒྱུས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས་སོ།
en: They maligned the noble ones, had wrong views, and truly held those wrong views. Because of those causes, after they died they fell to the lower realms and were reborn in the hells.

source: །སེམས་ཅན་འདི་རྣམས་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་ཏེ།
en: These beings conducted themselves well with their bodies, conducted themselves well with their speech, and conducted themselves well in their minds.

source: འཕགས་པ་རྣམས་ལ་མི་སྐུར་པ་ཡང་དག་པར་ལྟ་བ་དག །ཡང་དག་པར་ལྟ་བ་ཡང་དག་པར་བཟུང་བའི་རྒྱུས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷའི་ནང་དུ་སྐྱེས་སོ་ཞེས་དེ་ལྟར་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་སེམས་ཅན་རྣམས་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་བཟང་བ་དང་། ཁ་དོག་ངན་པ་དང་། བདེ་འགྲོར་སོང་བ་དང་། ངན་འགྲོར་སོང་བ་དང་། ངན་པ་དང་། བཟང་པོ་དང་། བཟང་འགྲོར་འགྲོ་བ་དང་། ངན་འགྲོར་འགྲོ་བའི་སེམས་ཅན་ལས་བཞིན་དུ་ཉེ་བར་འགྲོ་བ་དག་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ།
en: They did not malign the noble ones, had correct views, and truly held those correct views. Because of those causes, after they died they went to the higher realms and were reborn in the paradises.’ “In that way they have the pure divine vision that transcends that of humans, so that they know correctly, according to the karma of beings, their deaths and their rebirths, whether they have good color or bad color, whether they are fortunate or unfortunate, whether it is a good rebirth or a bad rebirth, and whether they go to the higher realms or the lower realms.

source: །གཞོན་ནུ་ལུས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་གང་ཅུང་ཟད་ཤེས་པར་བྱ་བ་དང་། བལྟ་བར་བྱ་བ་དང་། མཉན་པར་བྱ་བ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་དང་། རྣམ་པར་འཕྲུལ་བར་བྱ་བ་དེ་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཐོས་སོ། །མཐོང་ངོ་། །རྟོགས་སོ།
en: “Young man, bodhisattva mahāsattvas who have completely pure physical conduct in one instant of wisdom accurately know, hear, see, and understand everything that is to be known, to be heard, to be seen, to be realized, and to be manifested.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱོབ་པ་ཡི། །མངོན་པར་ཤེས་པའི་རིམ་པ་བསྟན།
en: Of the protector bodhisattvas are taught.

source: །ཏིང་ངེ་འཛིན་ལ་གནས་པས་ན།
en: The ones who remain in samādhi

source: །བྱང་ཆུབ་སེམས་དཔའ་ཞེས་ཀྱང་བྱ།
en: Are known as bodhisattvas. {51}

source: །དེ་དག་རྣ་བ་རྣམ་སྦྱོང་སྟེ།
en: “Their hearing is purified to become

source: །ལྷ་ཡི་རྣ་བ་བསམ་མི་ཁྱབ།
en: Inconceivable divine hearing. They hear the Dharma that is

source: །སངས་རྒྱས་ཀུན་གྱིས་བཤད་པ་ཡི། །ཆོས་རྣམས་དེ་ཡིས་ཐོས་པར་འགྱུར།
en: Taught by all the buddhas. {52}

source: །སྟོང་གསུམ་ཆེན་པོའི་འཇིག་རྟེན་ཁམས་དག་ན།
en: “The skilled bodhisattvas, while sitting,

source: །ལྷ་ཡི་དྲི་རྣམས་ཇི་སྙེད་ཡོད་པ་ཀུན།
en: With a divine sense of smell Smell all the divine Dharma aromas

source: །ལྷ་ཡི་སྣ་ཡིས་ཇི་ལྟར་འདུག་བཞིན་དུ།
en: In the great billion-world universe. {i}

source: །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་དེ་སྣོམ་བྱེད།
en: “They know the minds of all beings:

source: །འདོད་ཆགས་བཅས་དང་འདོད་ཆགས་མེད་པ་དང་། །ཞེ་སྡང་བཅས་དང་ཞེ་སྡང་བྲལ་བ་དང་། །གཏི་མུག་བཅས་དང་གཏི་མུག་བྲལ་བ་ཡི།
en: Whether they have or do not have desire, Whether they have or do not have anger, Whether they have or do not have ignorance. {53}

source: །སེམས་རྣམས་སྲོག་ཆགས་ཀུན་གྱི་རབ་ཏུ་ཤེས།
en: “They know where they lived in the past,

source: །བསྐལ་པ་བྱེ་བ་སྟོང་དུ་ནི། །གང་དུ་དེ་དག་སྔོན་གནས་པ། །སྔོན་གྱི་གནས་རྣམས་རབ་ཏུ་ཤེས།
en: Those places where they previously lived Throughout billions of eons;

source: །དེ་དག་ལ་ནི་ཐོགས་པ་མེད།
en: They know them without any impediment. {54}

source: །དེ་དག་མིག་ཀྱང་རྣམ་སྦྱོང་སྟེ།
en: “Their sight, too, is purified;

source: །བླ་ན་མེད་པའི་ལྷ་ཡི་མིག །དེས་ནི་སེམས་ཅན་སྐྱེ་བ་དང་། །འཆི་འཕོ་དེ་དག་རབ་ཏུ་མཐོང་།
en: They have insurpassable, divine sight. They see perfectly the deaths Of beings and their rebirths. {55}

source: །སྐད་ཅིག་གཅིག་དང་ལྡན་པ་ཡི།
en: “Within a single instant

source: །ཤེས་རབ་ཀྱིས་ནི་ཚེ་རབས་ཀུན། །ཆོས་རྣམས་ལ་ནི་ཤེས་བྱ་བ། །ཅི་ཡོད་པ་ཡང་ཡང་དག་ཤེས། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: They know all lifetimes. They know correctly every single Phenomenon that can be known.” {56}

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་ངག་གི་སྡོམ་པས་བསྡམ་པར་བྱའོ་ཞེས་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Then the Bhagavān said to Candraprabha, “Young man, you should train by thinking, ‘I will engage in completely pure conduct of speech in that way.’

source: །གཞོན་ནུ་དེ་ལ་ངག་གི་སྡོམ་པ་གང་ཞེ་ན།
en: “Young man, what is the restraint of speech?

source: ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་དྲུག་ཅུ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་ཐོགས་པ་མེད་པ།
en: Young man, bodhisattva mahāsattvas who have completely pure conduct of speech attain the inconceivable, unimpeded buddha’s speech, which has sixty aspects.

source: བསམ་གྱིས་མི་ཁྱབ་པ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚིག་བཙུན་པ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of speech have the attainment of noble words. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the thirty-two primary signs of a great being. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the eighty secondary signs of a great being. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་འཐོབ་པ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the ten strengths of a tathāgata, the four fearlessnesses, and the eighteen distinct qualities of a buddha. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་འཐོབ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the three doorways to liberation.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these three?

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་འདི་གསུམ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are emptiness, the absence of attributes, and the absence of aspiration. They attain those three doorways to liberation. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚངས་པའི་གནས་པ་ཆེན་པོ་བཞི་འཐོབ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the four great brahmavihāras. What are the four great brahmavihāras?

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། ཚངས་པའི་གནས་པ་ཆེན་པོ་འདི་བཞི་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are great love, great compassion, great joy, and great equanimity. They attain those four great brahmavihāras. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་འཐོབ་སྟེ། །བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the four discernments. What are the four discernments?

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་འདི་བཞི་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are the discernment of meaning, the discernment of phenomena, the discernment of definitions, and the discernment of eloquence. They attain those four discernments. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་འཐོབ་སྟེ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the thirty-seven aspects of enlightenment.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are the four kinds of mindfulness, the four correct exertions, the four bases for miraculous powers, the five powers, the five strengths, the seven aspects of enlightenment, and the noble eightfold path. They attain those thirty-seven aspects of enlightenment. Young man, that is the restraint of speech.

source: །ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་འཐོབ་པ་དང་། བཏང་སྙོམས་ཆེན་པོ་ལ་གནས་པ་འཐོབ་པ་དང་། བདེ་བའི་རྣམ་པར་རྟོག་པ་འཐོབ་པ་དང་། རབ་ཏུ་དབེན་པའི་ཆོས་རྣམས་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Bodhisattva mahāsattvas who have the restraint of speech attain the state of great compassion, attain the state of great equanimity, attain easeful examination, and attain the quality of being devoid of examination. Young man, that is the restraint of speech.

source: །གཞན་ཡང་གཞོན་ནུ་ངག་གི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲོག་གཅོད་པ་སྤོང་བར་འགྱུར་བ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། མི་ཚངས་པར་སྤྱོད་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མའི་ཚིག་དང་། ཚིག་རྩུབ་པོ་དང་། ཁྱལ་པར་སྨྲ་བ་སྤངས་པར་འགྱུར་བ་དང་། ཕ་མ་དང་སློབ་དཔོན་དག་ལ་མི་བདེན་པའི་ཚིག་མི་འབྱིན་པ་དང་། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་མི་སྨོད་པ་དང་། ཚིག་གཞན་ལ་ཡང་གང་ཉེས་པ་དང་ལྡན་པའི་ཚིག་དེ་དག་བྱང་ཆུབ་སེམས་དཔས་སྤངས་པ་ཡིན་ཏེ།
en: “Moreover, young man, bodhisattva mahāsattvas who have the restraint of speech desist from killing, taking what is not given, not maintaining celibacy, lying, slandering, harsh speech, and idle talk. Those bodhisattva mahāsattvas desist from speaking untrue words to their parents and their teachers; from maligning the Buddha, Dharma, and Saṅgha; and from any other words that are harmful words.

source: ཚིག་དེ་དག་ཀྱང་བྲག་ཅ་ལྟ་བུར་ཤེས་སོ།
en: They know those words to be like echoes.

source: །སྤྲུལ་པ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུར་འཇུག་པར་བྱེད་དོ། །དེ་ལྟ་བུར་གྱུར་པས་ཚིག་དེ་ལ་མི་དམིགས། མི་རྟོག །རློམ་སེམས་སུ་མི་བྱེད། མི་ལྟ། མངོན་པར་ཆགས་པར་མི་བྱེད་དེ།
en: They perceive them to be like apparitions, mirages, hallucinations, and illusions, and in that way they do not objectify words, conceptualize them, become proud of them, view them, or become attached to them.

source: གཞོན་ནུ་དེ་ནི་ངག་གི་སྡོམ་པ་ཞེས་བྱའོ།
en: Young man, that is the restraint of speech.”
